Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_psram.c
/****************************************************************************
 * vendor/espressif/chips/esp32p4/esp32p4_psram.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/mm/mm.h>
#include <nuttx/board.h>

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <errno.h>
#include <malloc.h>

#include "riscv_internal.h"
#include "chip.h"
#include "esp32p4_psram.h"
#include "hardware/esp32p4_mspi.h"
#include "hardware/esp32p4_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* PSRAM initialization timeout (iterations) */

#define PSRAM_TIMEOUT               10000
#define PSRAM_RESET_DELAY           10000
#define PSRAM_MODE_SWITCH_DELAY     1000

/* MMU configuration */

#define MMU_INVALID_ENTRY           0xFFFFFFFF
#define MMU_PSRAM_TARGET            0x02  /* PSRAM target ID */

/* Self-test patterns */

#define TEST_PATTERN_AA             0xAAAAAAAA
#define TEST_PATTERN_55             0x55555555
#define TEST_PATTERN_ADDR           0xDEADBEEF
#define TEST_PATTERN_INV            0x21524110

/* PSRAM density codes */

#define PSRAM_DENSITY_4MB           0x01
#define PSRAM_DENSITY_8MB           0x03
#define PSRAM_DENSITY_16MB          0x05
#define PSRAM_DENSITY_32MB          0x07
#define PSRAM_DENSITY_64MB          0x06

/* Register access macros */

#define PSRAM_READ_REG(offset)      \
  getreg32(MSPI_SPI0_BASE + (offset))
#define PSRAM_WRITE_REG(offset, val) \
  putreg32((val), MSPI_SPI0_BASE + (offset))
#define PSRAM_MODIFY_REG(offset, clear, set) \
  modifyreg32(MSPI_SPI0_BASE + (offset), (clear), (set))

/* HP_SYS_CLKRST base address for PSRAM clock configuration.
 * ESP32-P4 HP_SYS_CLKRST is at HPPERIPH1_BASE + 0x26000 = 0x500E6000.
 * PERI_CLK_CTRL00_REG controls flash and PSRAM clock sources.
 */

#define HP_SYS_CLKRST_BASE              0x500e6000
#define HP_SYS_CLKRST_PERI_CLK_CTRL00  (HP_SYS_CLKRST_BASE + 0x30)

/* PSRAM clock source selection (bits [13:12] of PERI_CLK_CTRL00):
 *   0 = XTAL (40 MHz)
 *   1 = MPLL (400 MHz)
 *   2 = SPLL
 *   3 = CPLL
 */

#define PSRAM_CLK_SRC_SEL_S             12
#define PSRAM_CLK_SRC_SEL_M             (0x3 << PSRAM_CLK_SRC_SEL_S)
#define PSRAM_CLK_SRC_MPLL              (1 << PSRAM_CLK_SRC_SEL_S)
#define PSRAM_PLL_CLK_EN                (1 << 14)
#define PSRAM_CORE_CLK_EN               (1 << 15)
#define PSRAM_CORE_CLK_DIV_S            16
#define PSRAM_CORE_CLK_DIV_M            (0xff << PSRAM_CORE_CLK_DIV_S)

/* PSRAM MSPI MMU registers.
 * ESP32-P4 PSRAM MMU uses register-based access (index/content pair).
 * DR_REG_PSRAM_MSPI0_BASE = 0x50000000 + 0x8E000 = 0x5008E000.
 * MMU_ITEM_INDEX_REG  at offset 0x380
 * MMU_ITEM_CONTENT_REG at offset 0x37c
 */

#define PSRAM_MSPI0_BASE                0x5008e000
#define PSRAM_MMU_ITEM_INDEX_REG        (PSRAM_MSPI0_BASE + 0x380)
#define PSRAM_MMU_ITEM_CONTENT_REG      (PSRAM_MSPI0_BASE + 0x37c)

/* PSRAM MMU entry content flags (from ESP-IDF ext_mem_defs.h) */

#define SOC_MMU_PSRAM_VALID             (1 << 11)
#define SOC_MMU_ACCESS_PSRAM            (1 << 10)
#define SOC_MMU_PSRAM_VALID_VAL_MASK    0x3ff

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* PSRAM mode register structure (AP-PSRAM hex mode) */

struct psram_mode_reg_s
{
  uint8_t mr0;  /* Drive strength, read latency, latency type */
  uint8_t mr1;  /* Vendor ID */
  uint8_t mr2;  /* Density, device ID, KGD */
  uint8_t mr3;  /* SRF, RBX enable */
  uint8_t mr4;  /* PASR, refresh, write latency */
  uint8_t mr8;  /* Burst length, burst type, X16 mode */
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static bool s_psram_initialized = false;
static uint32_t s_psram_size = 0;
static uint32_t s_psram_clk_freq = 0;
static uint32_t s_error_count = 0;

/* Default configuration */

static const struct esp32p4_psram_config_s g_default_config =
{
  .size = ESP32P4_PSRAM_SIZE,
  .clk_freq = ESP32P4_PSRAM_CLK_200MHZ,
  .opi_mode = true,
  .ecc_enable = false,
  .self_test = true,
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void psram_set_clock(uint32_t freq_hz);
static int psram_send_cmd(uint16_t cmd, int addr_bits, uint32_t addr,
                          int dummy, uint8_t *read_buf, int read_len);
static void psram_reset(void);
static int psram_read_id(uint16_t *id);
static void psram_enter_opi(void);
static void psram_config_opi(void);
static void psram_config_cache(void);
static int psram_detect_size(uint16_t id);
static int psram_config_mmu(void);
static void psram_enable_mpll(void);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: psram_enable_mpll
 *
 * Description:
 *   Enable the MPLL (MSPI PLL) clock at 400 MHz for PSRAM access.
 *
 ****************************************************************************/

