Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_psram.c
static void psram_enable_mpll(void)
{
  /* Enable MPLL clock source for PSRAM.
   *
   * MPLL provides 400 MHz clock for the MSPI controller.
   * Clock tree: XTAL (40 MHz) -> MPLL -> 400 MHz
   *
   * Configure HP_SYS_CLKRST_PERI_CLK_CTRL00_REG:
   *   - PSRAM_CLK_SRC_SEL = 1 (MPLL, 400 MHz)
   *   - PSRAM_PLL_CLK_EN  = 1 (enable PLL-derived clock)
   *   - PSRAM_CORE_CLK_EN = 1 (enable PSRAM core clock)
   *   - PSRAM_CORE_CLK_DIV = 0 (divide by 1, full speed)
   *
   * Note: MPLL itself is typically already enabled by the boot ROM
   * or early startup code. This function only selects MPLL as the
   * PSRAM clock source and enables the clock gating.
   */

  uint32_t regval;

  regval = getreg32(HP_SYS_CLKRST_PERI_CLK_CTRL00);

  /* Select MPLL as PSRAM clock source */

  regval &= ~PSRAM_CLK_SRC_SEL_M;
  regval |= PSRAM_CLK_SRC_MPLL;

  /* Enable PLL clock and core clock for PSRAM */

  regval |= PSRAM_PLL_CLK_EN;
  regval |= PSRAM_CORE_CLK_EN;

  /* Set core clock divider to 1 (no division) */

  regval &= ~PSRAM_CORE_CLK_DIV_M;

  putreg32(regval, HP_SYS_CLKRST_PERI_CLK_CTRL00);

  s_psram_clk_freq = ESP32P4_PSRAM_CLK_MPLL;
}

/****************************************************************************
 * Name: psram_set_clock
 *
 * Description:
 *   Configure the MSPI SPI0 clock for PSRAM access.
 *
 * Input Parameters:
 *   freq_hz - Target clock frequency in Hz
 *
 ****************************************************************************/

static void psram_set_clock(uint32_t freq_hz)
{
  uint32_t regval;
  uint32_t div;

  /* Calculate clock divider from source frequency.
   * SPI_CLK = CLK_SRC / (CLKCNT_N + 1)
   * For simplicity, use equal duty cycle: H = N/2, L = N
   */

  div = ESP32P4_PSRAM_CLK_MPLL / freq_hz;
  if (div < 1)
    {
      div = 1;
    }

  /* Configure SRAM clock register.
   * Set divider and equal duty cycle (50%).
   */

  regval = ((div - 1) << SPI_MEM_SCLKCNT_N_S) |
           (((div / 2) - 1) << SPI_MEM_SCLKCNT_H_S) |
           ((div - 1) << SPI_MEM_SCLKCNT_L_S);

  PSRAM_WRITE_REG(SPI_MEM_SRAM_CLK_REG, regval);
}

/****************************************************************************
 * Name: psram_send_cmd
 *
 * Description:
 *   Send a command to PSRAM via the MSPI controller.
 *
 * Input Parameters:
 *   cmd       - Command value
 *   addr_bits - Number of address bits (0 if no address phase)
 *   addr      - Address value
 *   dummy     - Number of dummy cycles
 *   read_buf  - Buffer for read data (NULL if no read phase)
 *   read_len  - Number of bytes to read
 *
 * Returned Value:
 *   0 on success, negative errno on failure
 *
 ****************************************************************************/

static int psram_send_cmd(uint16_t cmd, int addr_bits, uint32_t addr,
                          int dummy, uint8_t *read_buf, int read_len)
{
  uint32_t regval;
  volatile int timeout;

  /* Configure user register: enable command phase */

  regval = SPI_MEM_USR_COMMAND;
  if (addr_bits > 0)
    {
      regval |= SPI_MEM_USR_ADDR;
    }

  if (dummy > 0)
    {
      regval |= SPI_MEM_USR_DUMMY;
    }

  if (read_len > 0)
    {
      regval |= SPI_MEM_USR_MISO;
    }

  PSRAM_WRITE_REG(SPI_MEM_USER_REG, regval);

  /* Configure command value and length */

  regval = (cmd & SPI_MEM_USR_COMMAND_VALUE_M) |
           ((7 << SPI_MEM_USR_COMMAND_BITLEN_S) &
            SPI_MEM_USR_COMMAND_BITLEN_M);

  PSRAM_WRITE_REG(SPI_MEM_USER2_REG, regval);

  /* Configure address and dummy cycles */

  if (addr_bits > 0)
    {
      regval = (((addr_bits - 1) << SPI_MEM_USR_ADDR_BITLEN_S) &
                SPI_MEM_USR_ADDR_BITLEN_M);
      PSRAM_WRITE_REG(SPI_MEM_USER1_REG, regval);
      PSRAM_WRITE_REG(SPI_MEM_ADDR_REG, addr);
    }

  if (dummy > 0)
    {
      PSRAM_MODIFY_REG(SPI_MEM_USER1_REG,
                       SPI_MEM_USR_DUMMY_CYCLELEN_M,
                       ((dummy - 1) << SPI_MEM_USR_DUMMY_CYCLELEN_S));
    }

  /* Set data length */

  if (read_len > 0)
    {
      PSRAM_WRITE_REG(SPI_MEM_MS_DLEN_REG,
                      ((read_len * 8 - 1) << SPI_MEM_MS_DATA_BITLEN_S));
    }

  /* Start the transaction */

  PSRAM_WRITE_REG(SPI_MEM_CMD_REG, SPI_MEM_USR);

  /* Wait for completion */

  for (timeout = 0; timeout < PSRAM_TIMEOUT; timeout++)
    {
      regval = PSRAM_READ_REG(SPI_MEM_CMD_REG);
      if (!(regval & SPI_MEM_USR))
        {
          break;
        }
    }

  if (timeout >= PSRAM_TIMEOUT)
    {
      s_error_count++;
      return -ETIMEDOUT;
    }

  /* Read response data if requested */

  if (read_buf != NULL && read_len > 0)
    {
      uint32_t rdata = PSRAM_READ_REG(SPI_MEM_R(0));
      int i;

      for (i = 0; i < read_len && i < 4; i++)
        {
          read_buf[i] = (rdata >> (i * 8)) & 0xff;
        }
    }

  return ESP32P4_PSRAM_OK;
}

/****************************************************************************
 * Name: psram_reset
 *
 * Description:
 *   Send reset command sequence to PSRAM.
 *   The reset sequence is: Reset Enable (0x66) followed by Reset (0x99).
 *
 ****************************************************************************/

static void psram_reset(void)
{
  /* Send Reset Enable command */

  psram_send_cmd(PSRAM_CMD_RESET_EN_OPI, 0, 0, 0, NULL, 0);

  /* Send Reset command */

  psram_send_cmd(PSRAM_CMD_RESET_OPI, 0, 0, 0, NULL, 0);

  /* Wait for reset to complete */

  volatile int i;
  for (i = 0; i < PSRAM_RESET_DELAY; i++)
    {
    }
}

/****************************************************************************
 * Name: psram_read_id
 *
 * Description:
 *   Read the PSRAM chip ID to verify it is present and accessible.
 *
 * Input Parameters:
 *   id - Pointer to store the 16-bit PSRAM ID
 *
 * Returned Value:
 *   0 on success, negative errno on failure
 *
 ****************************************************************************/

static int psram_read_id(uint16_t *id)
{
  uint8_t id_buf[2];
  int ret;

  /* Read ID using SPI mode command (0x9F).
   * The PSRAM responds with a 16-bit ID.
   */

  ret = psram_send_cmd(PSRAM_CMD_READ_ID_SPI,
                       24, 0x000000, 0,
                       id_buf, 2);
  if (ret < 0)
    {
      return ret;
    }

  *id = (id_buf[1] << 8) | id_buf[0];
  return ESP32P4_PSRAM_OK;
}

/****************************************************************************
 * Name: psram_enter_opi
 *
 * Description:
 *   Switch PSRAM from SPI mode to OPI (Octal SPI) mode.
 *
 ****************************************************************************/

