Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_psram.c
static void psram_enter_opi(void)
{
  /* Send Enter OPI Mode command (0xA0) in SPI mode */

  psram_send_cmd(PSRAM_CMD_ENTER_OPI, 0, 0, 0, NULL, 0);

  /* Wait for mode switch to complete */

  volatile int i;
  for (i = 0; i < PSRAM_MODE_SWITCH_DELAY; i++)
    {
    }
}

/****************************************************************************
 * Name: psram_config_opi
 *
 * Description:
 *   Configure the MSPI SPI0 controller for OPI PSRAM access.
 *
 ****************************************************************************/

static void psram_config_opi(void)
{
  uint32_t regval;

  /* Configure SPI0 control register for OPI mode.
   * Enable octal read and octal command modes.
   */

  PSRAM_MODIFY_REG(SPI_MEM_CTRL_REG, 0,
                   SPI_MEM_FREAD_OCT | SPI_MEM_FCMD_OCT);

  /* Configure SRAM read command for OPI mode.
   * Read command: 0x2000 (16-bit, sent on all 8 lines)
   * Address: 32 bits (24-bit address + 8-bit burst length)
   * Dummy: 4 cycles (for OPI read latency)
   */

  regval = (PSRAM_CMD_READ_OPI << 16);  /* Read command value */
  PSRAM_WRITE_REG(SPI_MEM_SRAM_DRD_CMD_REG, regval);

  /* Configure SRAM write command for OPI mode.
   * Write command: 0x8000 (16-bit, sent on all 8 lines)
   * Address: 32 bits
   */

  regval = (PSRAM_CMD_WRITE_OPI << 16);  /* Write command value */
  PSRAM_WRITE_REG(SPI_MEM_SRAM_DWR_CMD_REG, regval);

  /* Enable user-defined read/write commands for SRAM cache access */

  PSRAM_MODIFY_REG(SPI_MEM_SRAM_CMD_REG, 0,
                   SPI_MEM_CACHE_SRAM_USR_RCMD | SPI_MEM_CACHE_SRAM_USR_WCMD);

  /* Configure clock for OPI PSRAM access at the target frequency.
   * Start with a conservative 80 MHz for reliability.
   */

  psram_set_clock(ESP32P4_PSRAM_CLK_80MHZ);
}

/****************************************************************************
 * Name: psram_config_cache
 *
 * Description:
 *   Configure the cache controller to map PSRAM into the CPU address space.
 *
 ****************************************************************************/

static void psram_config_cache(void)
{
  /* Enable cache for SRAM (PSRAM) access.
   * The XMC (eXternal Memory Controller) handles the cache mapping.
   */

  PSRAM_MODIFY_REG(SPI_MEM_CACHE_SCTRL_REG, 0,
                   SPI_MEM_CACHE_FMEM_CACHE_EN | SPI_MEM_CACHE_FMEM_MBUS_EN);

  /* Configure 32-bit address mode for PSRAM (required for > 16MB) */

  PSRAM_MODIFY_REG(SPI_MEM_CACHE_FCTRL_REG, 0,
                   SPI_MEM_CACHE_USR_CMD_4BYTE);
}

/****************************************************************************
 * Name: psram_detect_size
 *
 * Description:
 *   Detect PSRAM size from density code in mode register.
 *
 * Input Parameters:
 *   id - PSRAM ID containing density information
 *
 * Returned Value:
 *   PSRAM size in bytes, or 0 if unknown
 *
 ****************************************************************************/

static int psram_detect_size(uint16_t id)
{
  /* Extract density from ID (bits 2:0 of high byte) */

  uint8_t density = (id >> 8) & 0x07;

  switch (density)
    {
      case PSRAM_DENSITY_4MB:
        return 4 * 1024 * 1024;

      case PSRAM_DENSITY_8MB:
        return 8 * 1024 * 1024;

      case PSRAM_DENSITY_16MB:
        return 16 * 1024 * 1024;

      case PSRAM_DENSITY_32MB:
        return 32 * 1024 * 1024;

      case PSRAM_DENSITY_64MB:
        return 64 * 1024 * 1024;

      default:
        return 0;
    }
}

/****************************************************************************
 * Name: psram_config_mmu
 *
 * Description:
 *   Configure MMU page table for PSRAM mapping.
 *   Maps PSRAM physical addresses to virtual addresses starting at
 *   ESP32P4_PSRAM_BASE (0x48000000).
 *
 * Returned Value:
 *   0 on success, negative errno on failure
 *
 ****************************************************************************/

static int psram_config_mmu(void)
{
  uint32_t num_pages;
  uint32_t i;
  uint32_t paddr_page;
  uint32_t entry_val;

  /* Calculate number of 64KB pages needed */

  num_pages = (s_psram_size + ESP32P4_MMU_PAGE_SIZE - 1) /
              ESP32P4_MMU_PAGE_SIZE;

  if (num_pages > ESP32P4_MMU_ENTRY_COUNT)
    {
      num_pages = ESP32P4_MMU_ENTRY_COUNT;
    }

  /* Configure MMU entries via register-based access.
   *
   * ESP32-P4 PSRAM MMU uses an index/content register pair:
   *   1. Write entry index to SPI_MEM_S_MMU_ITEM_INDEX_REG
   *   2. Write entry content to SPI_MEM_S_MMU_ITEM_CONTENT_REG
   *
   * Entry content format for PSRAM (64KB page size):
   *   [31:13] - Reserved
   *   [12]    - Encryption sensitive bit (SOC_MMU_PSRAM_SENSITIVE)
   *   [11]    - Valid bit (SOC_MMU_PSRAM_VALID)
   *   [10]    - Access type: 1 = PSRAM (SOC_MMU_ACCESS_PSRAM)
   *   [9:0]   - Physical page number (SOC_MMU_PSRAM_VALID_VAL_MASK)
   *
   * With 64KB pages and 10-bit page number, max physical address
   * is 1024 * 64KB = 64 MB, matching ESP32-P4 PSRAM max size.
   */

  for (i = 0; i < num_pages; i++)
    {
      /* Physical page number = physical_address >> 16 (64KB shift) */

      paddr_page = i;

      /* Build entry value: page number | valid | PSRAM access */

      entry_val = (paddr_page & SOC_MMU_PSRAM_VALID_VAL_MASK) |
                  SOC_MMU_PSRAM_VALID |
                  SOC_MMU_ACCESS_PSRAM;

      /* Write to MMU hardware registers (index then content) */

      putreg32(i, PSRAM_MMU_ITEM_INDEX_REG);
      putreg32(entry_val, PSRAM_MMU_ITEM_CONTENT_REG);
    }

  /* Invalidate all caches after MMU reconfiguration.
   *
   * Use RISC-V fence instructions to ensure cache coherency:
   *   - fence.i: instruction cache fence (ensures I-cache sees new mappings)
   *   - fence rw, rw: data fence (ensures D-cache consistency)
   *
   * This is the NuttX-portable approach for RISC-V targets.
   * The ESP-IDF ROM-based Cache_Invalidate_All() is not available
   * in the NuttX environment.
   */

  __asm__ volatile ("fence.i" ::: "memory");
  __asm__ volatile ("fence rw, rw" ::: "memory");

  return ESP32P4_PSRAM_OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_psram_init
 *
 * Description:
 *   Initialize the PSRAM subsystem.
 *
 ****************************************************************************/

int esp32p4_psram_init(const struct esp32p4_psram_config_s *config)
{
  uint16_t psram_id;
  int ret;

