Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_psram.c
  /* Use default configuration if none provided */

  if (config == NULL)
    {
      config = &g_default_config;
    }

  /* Check if already initialized */

  if (s_psram_initialized)
    {
      return ESP32P4_PSRAM_OK;
    }

  /* Step 1: Enable MPLL clock (400 MHz) */

  psram_enable_mpll();

  /* Step 2: Configure MSPI clock for initial PSRAM communication */

  psram_set_clock(ESP32P4_PSRAM_CLK_80MHZ);

  /* Step 3: Reset PSRAM chip */

  psram_reset();

  /* Step 4: Read PSRAM ID to verify the chip is present */

  ret = psram_read_id(&psram_id);
  if (ret < 0)
    {
      /* PSRAM not responding */

      return ESP32P4_PSRAM_ERR_NOT_FOUND;
    }

  /* Step 5: Detect PSRAM size */

  s_psram_size = psram_detect_size(psram_id);
  if (s_psram_size == 0)
    {
      /* Use configured size as fallback */

      s_psram_size = config->size;
    }

  /* Step 6: Enter OPI mode if configured */

  if (config->opi_mode)
    {
      psram_enter_opi();
      psram_config_opi();
    }

  /* Step 7: Configure cache mapping */

  psram_config_cache();

  /* Step 8: Configure MMU page table */

  ret = psram_config_mmu();
  if (ret < 0)
    {
      return ESP32P4_PSRAM_ERR_MMAP;
    }

  /* Step 9: Run self-test if configured */

  if (config->self_test)
    {
      ret = esp32p4_psram_self_test();
      if (ret < 0)
        {
          return ESP32P4_PSRAM_ERR_TEST;
        }
    }

  /* Mark as initialized */

  s_psram_initialized = true;

  return ESP32P4_PSRAM_OK;
}

/****************************************************************************
 * Name: esp32p4_psram_is_initialized
 *
 * Description:
 *   Check if PSRAM is initialized and available.
 *
 ****************************************************************************/

bool esp32p4_psram_is_initialized(void)
{
  return s_psram_initialized;
}

/****************************************************************************
 * Name: esp32p4_psram_get_size
 *
 * Description:
 *   Get the size of the initialized PSRAM.
 *
 ****************************************************************************/

uint32_t esp32p4_psram_get_size(void)
{
  if (!s_psram_initialized)
    {
      return 0;
    }

  return s_psram_size;
}

/****************************************************************************
 * Name: esp32p4_psram_get_stats
 *
 * Description:
 *   Get PSRAM usage statistics.
 *
 ****************************************************************************/

int esp32p4_psram_get_stats(struct esp32p4_psram_stats_s *stats)
{
  if (stats == NULL)
    {
      return -EINVAL;
    }

  if (!s_psram_initialized)
    {
      return -ENODEV;
    }

  stats->total_size = s_psram_size;

  /* Calculate heap usage from NuttX mallinfo.
   *
   * The PSRAM region is added to the global NuttX heap via
   * mm_addregion() during board initialization. The mallinfo()
   * function returns aggregate statistics for the entire heap
   * (internal SRAM + PSRAM combined).
   *
   * For a more accurate PSRAM-only breakdown, the caller would
   * need to query the heap region manager directly. Here we
   * provide the overall heap usage as an approximation.
   */

  struct mallinfo info = mallinfo();

  stats->used_size = (uint32_t)info.uordblks;
  stats->free_size = (uint32_t)info.fordblks;
  stats->dma_capable = s_psram_size;  /* PSRAM is DMA-capable via AXI bus */
  stats->error_count = s_error_count;

  return ESP32P4_PSRAM_OK;
}

/****************************************************************************
 * Name: esp32p4_psram_self_test
 *
 * Description:
 *   Run a self-test on the PSRAM.
 *
 ****************************************************************************/

int esp32p4_psram_self_test(void)
{
  volatile uint32_t *psram_ptr = (volatile uint32_t *)ESP32P4_PSRAM_BASE;
  uint32_t test_size = 4096;  /* Test first 4KB */
  uint32_t i;
  uint32_t errors = 0;

  if (!s_psram_initialized)
    {
      return -ENODEV;
    }

  /* Phase 1: Write test pattern (0xAAAAAAAA) */

  for (i = 0; i < test_size / sizeof(uint32_t); i++)
    {
      psram_ptr[i] = TEST_PATTERN_AA;
    }

  /* Verify test pattern */

  for (i = 0; i < test_size / sizeof(uint32_t); i++)
    {
      if (psram_ptr[i] != TEST_PATTERN_AA)
        {
          errors++;
        }
    }

  /* Phase 2: Write test pattern (0x55555555) */

  for (i = 0; i < test_size / sizeof(uint32_t); i++)
    {
      psram_ptr[i] = TEST_PATTERN_55;
    }

  /* Verify test pattern */

  for (i = 0; i < test_size / sizeof(uint32_t); i++)
    {
      if (psram_ptr[i] != TEST_PATTERN_55)
        {
          errors++;
        }
    }

  /* Phase 3: Address-based pattern test */

  for (i = 0; i < test_size / sizeof(uint32_t); i++)
    {
      psram_ptr[i] = (uint32_t)&psram_ptr[i] ^ TEST_PATTERN_ADDR;
    }

  /* Verify address-based pattern */

  for (i = 0; i < test_size / sizeof(uint32_t); i++)
    {
      uint32_t expected = (uint32_t)&psram_ptr[i] ^ TEST_PATTERN_ADDR;
      if (psram_ptr[i] != expected)
        {
          errors++;
        }
    }

  /* Phase 4: Walking ones test */

  for (i = 0; i < 32; i++)
    {
      psram_ptr[0] = (1 << i);
      if (psram_ptr[0] != (1 << i))
        {
          errors++;
        }
    }

  /* Clear test area */

  memset((void *)ESP32P4_PSRAM_BASE, 0, test_size);

  if (errors > 0)
    {
      s_error_count += errors;
      return ESP32P4_PSRAM_ERR_TEST;
    }

  return ESP32P4_PSRAM_OK;
}

/****************************************************************************
 * Name: esp32p4_psram_dma_test
 *
 * Description:
 *   Test DMA access to PSRAM.
 *
 ****************************************************************************/

int esp32p4_psram_dma_test(void)
{
  /* Test DMA-capable memory access to PSRAM.
   *
   * On ESP32-P4, PSRAM is connected via the AXI bus and is fully
   * DMA-accessible. The CPU can read/write PSRAM through the
   * memory-mapped address range (0x48000000 - 0x4BFFFFFF).
   *
   * This test verifies the data path between internal SRAM and
   * PSRAM using CPU memcpy, which exercises the same bus paths
   * that GDMA would use for M2M transfers.
   *
   * A full GDMA hardware test requires the GDMA driver to be
   * initialized separately (see esp32p4_gdma_test).
   */

