Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_psram.c
  static uint32_t sram_buf[256];  /* Internal SRAM buffer (1KB) */
  volatile uint32_t *psram_ptr = (volatile uint32_t *)ESP32P4_PSRAM_BASE;
  uint32_t test_count = 256;
  uint32_t i;
  uint32_t errors = 0;

  if (!s_psram_initialized)
    {
      return -ENODEV;
    }

  /* Phase 1: Write pattern to PSRAM, copy to internal SRAM, verify.
   * This tests the PSRAM -> SRAM DMA path (read from PSRAM).
   */

  for (i = 0; i < test_count; i++)
    {
      psram_ptr[i] = 0xa5a5a5a5 ^ i;
    }

  memcpy(sram_buf, (const void *)ESP32P4_PSRAM_BASE,
         test_count * sizeof(uint32_t));

  for (i = 0; i < test_count; i++)
    {
      if (sram_buf[i] != (0xa5a5a5a5 ^ i))
        {
          errors++;
        }
    }

  /* Phase 2: Write pattern to internal SRAM, copy to PSRAM, verify.
   * This tests the SRAM -> PSRAM DMA path (write to PSRAM).
   */

  for (i = 0; i < test_count; i++)
    {
      sram_buf[i] = 0x5a5a5a5a ^ i;
    }

  memcpy((void *)ESP32P4_PSRAM_BASE, sram_buf,
         test_count * sizeof(uint32_t));

  for (i = 0; i < test_count; i++)
    {
      if (psram_ptr[i] != (0x5a5a5a5a ^ i))
        {
          errors++;
        }
    }

  /* Clear test area */

  memset((void *)ESP32P4_PSRAM_BASE, 0,
         test_count * sizeof(uint32_t));

  if (errors > 0)
    {
      s_error_count += errors;
      return ESP32P4_PSRAM_ERR_DMA;
    }

  return ESP32P4_PSRAM_OK;
}

/****************************************************************************
 * Name: esp32p4_psram_mmap
 *
 * Description:
 *   Map a region of PSRAM into the CPU address space.
 *
 ****************************************************************************/

int esp32p4_psram_mmap(uint32_t phys_addr, uint32_t size, void **vaddr)
{
  if (!s_psram_initialized)
    {
      return -ENODEV;
    }

  if (vaddr == NULL)
    {
      return -EINVAL;
    }

  /* Check if the requested region is within PSRAM bounds */

  if (phys_addr + size > s_psram_size)
    {
      return -EINVAL;
    }

  /* The PSRAM is already mapped at ESP32P4_PSRAM_BASE.
   * Calculate the virtual address from the physical offset.
   */

  *vaddr = (void *)(ESP32P4_PSRAM_BASE + phys_addr);

  return ESP32P4_PSRAM_OK;
}

/****************************************************************************
 * Name: esp32p4_psram_get_heap_base
 *
 * Description:
 *   Get the base address of the PSRAM heap region.
 *
 ****************************************************************************/

void *esp32p4_psram_get_heap_base(void)
{
  if (!s_psram_initialized)
    {
      return NULL;
    }

  return (void *)ESP32P4_PSRAM_BASE;
}

/****************************************************************************
 * Name: esp32p4_psram_get_heap_size
 *
 * Description:
 *   Get the size of the PSRAM heap region.
 *
 ****************************************************************************/

uint32_t esp32p4_psram_get_heap_size(void)
{
  if (!s_psram_initialized)
    {
      return 0;
    }

  return s_psram_size;
}
